micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
/** @defgroup DCMIPP_Exported_Constants DCMIPP Exported Constants
  * @brief    DCMIPP Exported constants
  * @{
  */

/** @defgroup DCMIPP_Pipes DCMIPP Pipes
  * @{
  */
#define  DCMIPP_PIPE0      0U     /*!< DCMIPP Pipe0 (Dump pipe)       */
#define  DCMIPP_PIPE1      1U     /*!< DCMIPP Pipe1 (Main Pipe)       */
#define  DCMIPP_PIPE2      2U     /*!< DCMIPP Pipe2 (Ancillary pipe)  */
/**
  * @}
  */

/** @defgroup DCMIPP_Error_Codes DCMIPP Error Codes
  * @{
  */
#define HAL_DCMIPP_ERROR_NONE            (0x00000000U)             /*!< No error                  */
#define HAL_DCMIPP_ERROR_AXI_TRANSFER    (0x00000001U)             /*!< IPPLUG AXI Transfer error */
#define HAL_DCMIPP_ERROR_PARALLEL_SYNC   (0x00000002U)             /*!< Synchronization error     */
#define HAL_DCMIPP_ERROR_PIPE0_LIMIT     (0x00000004U)             /*!< Limit error on pipe0      */
#define HAL_DCMIPP_ERROR_PIPE0_OVR       (0x00000008U)             /*!< Overrun error on pipe0    */
#define HAL_DCMIPP_ERROR_PIPE1_OVR       (0x00000010U)             /*!< Overrun error on pipe1    */
#define HAL_DCMIPP_ERROR_PIPE2_OVR       (0x00000020U)             /*!< Overrun error on pipe2    */

#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS == 1)
#define  HAL_DCMIPP_ERROR_INVALID_CALLBACK ((uint32_t)0x00000040U) /*!< Invalid Callback error  */
#endif /* USE_HAL_DCMIPP_REGISTER_CALLBACKS */

#define HAL_DCMIPP_CSI_ERROR_NONE            (0x00000080U)       /*!< No error                               */
#define HAL_DCMIPP_CSI_ERROR_SYNC            (0x00000100U)       /*!< Synchronization error                  */
#define HAL_DCMIPP_CSI_ERROR_WDG             (0x00000200U)       /*!< Watchdog Error                         */
#define HAL_DCMIPP_CSI_ERROR_SPKT            (0x00000400U)       /*!< Shorter Packet than expected Error     */
#define HAL_DCMIPP_CSI_ERROR_DATA_ID         (0x00000800U)       /*!< Data ID Information Error              */
#define HAL_DCMIPP_CSI_ERROR_CECC            (0x00001000U)       /*!< Corrected ECC Error                    */
#define HAL_DCMIPP_CSI_ERROR_ECC             (0x00002000U)       /*!< ECC Error                              */
#define HAL_DCMIPP_CSI_ERROR_CRC             (0x00004000U)       /*!< CRC Error                              */
#define HAL_DCMIPP_CSI_ERROR_DPHY_CTRL       (0x00008000U)       /*!< Error Control on data line (0 OR 1)    */
#define HAL_DCMIPP_CSI_ERROR_DPHY_LP_SYNC    (0x00010000U)       /*!< Low-Power data transmssion Synchronisation
                                                                      Error on data line (0 OR 1)   */
#define HAL_DCMIPP_CSI_ERROR_DPHY_ESCAPE     (0x00020000U)       /*!< Escape Entry Error on data line (0 OR 1) */
#define HAL_DCMIPP_CSI_ERROR_SOT_SYNC        (0x00040000U)       /*!< SOT Synchronisation Error on data line(0 OR 1) */
#define HAL_DCMIPP_CSI_ERROR_SOT             (0x00080000U)       /*!< SOT Error on data line (0 OR 1)        */
/**
  * @}
  */

/** @defgroup DCMIPP_Capture_Mode DCMIPP Capture Mode
  * @{
  */
#define  DCMIPP_MODE_CONTINUOUS   0U                      /*!< DCMIPP continuous mode (preview) */
#define  DCMIPP_MODE_SNAPSHOT     DCMIPP_P0FCTCR_CPTMODE  /*!< DCMIPP snapshot mode             */
/**
  * @}
  */

/**
  * @defgroup  DCMIPP_modes (DCMI or CSI): modes are exclusive
  * @{
  */
#define  DCMIPP_PARALLEL_MODE   (0x00U << DCMIPP_CMCR_INSEL_Pos)  /*!< DCMIPP Parallel (DCMI) mode */
#define  DCMIPP_SERIAL_MODE     (0x01U << DCMIPP_CMCR_INSEL_Pos)  /*!< DCMIPP CSI mode             */
/**
  * @}
  */

/** @defgroup DCMIPP_IPPLUG_Client DCMIPP IPPLUG Client
  * @{
  */
#define DCMIPP_CLIENT1  1U /*!< Client 1 identifier */
#define DCMIPP_CLIENT2  2U /*!< Client 2 identifier */
#define DCMIPP_CLIENT3  3U /*!< Client 3 identifier */
#define DCMIPP_CLIENT4  4U /*!< Client 4 identifier */
#define DCMIPP_CLIENT5  5U /*!< Client 5 identifier */
/**
  * @}
  */

/** @defgroup DCMIPP_Traffic_Burst_Size DCMIPP Traffic Burst Size
  * @{
  */
#define DCMIPP_TRAFFIC_BURST_SIZE_8BYTES   0U                                   /*!< Traffic Burst size 8 Bytes   */
#define DCMIPP_TRAFFIC_BURST_SIZE_16BYTES  (0x01U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 16 Bytes  */
#define DCMIPP_TRAFFIC_BURST_SIZE_32BYTES  (0x02U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 32 Bytes  */
#define DCMIPP_TRAFFIC_BURST_SIZE_64BYTES  (0x03U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 64 Bytes  */
#define DCMIPP_TRAFFIC_BURST_SIZE_128BYTES (0x04U << DCMIPP_IPC1R1_TRAFFIC_Pos) /*!< Traffic Burst size 128 Bytes */
/**
  * @}
  */

/** @defgroup DCMIPP_Memory_Page_Size DCMIPP Memory Page Size
  * @{
  */
#define DCMIPP_MEMORY_PAGE_SIZE_64BYTES  0U                                     /*!< Memory Page size 64 Bytes  */
#define DCMIPP_MEMORY_PAGE_SIZE_128BYTES (0x01U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 128 Bytes */
#define DCMIPP_MEMORY_PAGE_SIZE_256BYTES (0x02U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 256 Bytes */
#define DCMIPP_MEMORY_PAGE_SIZE_512BYTES (0x03U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 512 Bytes */
#define DCMIPP_MEMORY_PAGE_SIZE_1KBYTES  (0x04U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 1 Bytes   */
#define DCMIPP_MEMORY_PAGE_SIZE_2KBYTES  (0x05U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 2 Bytes   */
#define DCMIPP_MEMORY_PAGE_SIZE_4KBYTES  (0x06U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 4 Bytes   */
#define DCMIPP_MEMORY_PAGE_SIZE_8KBYTES  (0x07U << DCMIPP_IPGR1_MEMORYPAGE_Pos) /*!< Memory Page size 8 Bytes   */
/**
  * @}
  */
/** @defgroup DCMIPP_Maximum_Outstanding_Transactions DCMIPP Maximum Outstanding Transactions
  * @{
  */
#define DCMIPP_OUTSTANDING_TRANSACTION_NONE 0U    /*!< Nooutstanding transaction limitation*/
#define DCMIPP_OUTSTANDING_TRANSACTION_2    0x01U /*!< Two outstanding transactions        */
#define DCMIPP_OUTSTANDING_TRANSACTION_3    0x02U /*!< Three outstanding transactions      */
#define DCMIPP_OUTSTANDING_TRANSACTION_4    0x03U /*!< Four outstanding transactions       */
#define DCMIPP_OUTSTANDING_TRANSACTION_5    0x04U /*!< 5 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_6    0x05U /*!< 6 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_7    0x06U /*!< 7 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_8    0x07U /*!< 8 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_9    0x08U /*!< 9 outstanding transactions          */
#define DCMIPP_OUTSTANDING_TRANSACTION_10   0x09U /*!< 10 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_11   0x0AU /*!< 11 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_12   0x0BU /*!< 12 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_13   0x0CU /*!< 13 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_14   0x0DU /*!< 14 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_15   0x0EU /*!< 15 outstanding transactions         */
#define DCMIPP_OUTSTANDING_TRANSACTION_16   0x0FU /*!< 16 outstanding transactions         */
/**
  * @}
  */

/** @defgroup DCMIPP_Frame_Rates  DCMIPP Frame Rates
  * @{
  */
#define DCMIPP_FRAME_RATE_ALL       0U                               /*!< All frames captured     */
#define DCMIPP_FRAME_RATE_1_OVER_2  (1U << DCMIPP_P0FCTCR_FRATE_Pos) /*!< 1 frame over 2 captured */
#define DCMIPP_FRAME_RATE_1_OVER_4  (2U << DCMIPP_P0FCTCR_FRATE_Pos) /*!< 1 frame over 4 captured */
#define DCMIPP_FRAME_RATE_1_OVER_8  (3U << DCMIPP_P0FCTCR_FRATE_Pos) /*!< 1 frame over 8 captured */
/**
  * @}
  */

