micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
/** @defgroup DCMIPP_SWAP_CYCLES  DCMIPP Swap Cycles
  * @{
  */
#define DCMIPP_SWAPCYCLES_DISABLE  0U                       /*!< swap data from cycle 0 vs cycle 1 */
#define DCMIPP_SWAPCYCLES_ENABLE   (DCMIPP_PRCR_SWAPCYCLES) /*!< swap data from cycle 0 vs cycle 1 */
/**
  * @}
  */

/** @defgroup DCMIPP_SWAP_BITS  DCMIPP Swap Bits
  * @{
  */
#define DCMIPP_SWAPBITS_DISABLE  0U                     /*!< swap lsb vs msb within each received component */
#define DCMIPP_SWAPBITS_ENABLE   (DCMIPP_PRCR_SWAPBITS) /*!< swap lsb vs msb within each received component */
/**
  * @}
  */

/** @defgroup DCMIPP_Pipe_Line_Decimation DCMIPP Pipe Line Decimation
  * @{
  */
/** @defgroup DCMIPP_Line_Select_Mode DCMIPP Line Select Mode
  * @{
  */
#define DCMIPP_LSM_ALL          0U                              /*!< Interface captures all received lines */
#define DCMIPP_LSM_ALTERNATE_2 (1U << DCMIPP_P0PPCR_LSM_Pos )   /*!< Interface captures one line out of two */
/**
  * @}
  */
/** @defgroup DCMIPP_Line_Start_Mode DCMIPP Line Start Mode
  * @{
  */
#define DCMIPP_OELS_ODD         0U                              /*!< Interface captures first line from the frame start,
                                                                     second one is dropped */
#define DCMIPP_OELS_EVEN       (1U << DCMIPP_P0PPCR_OELS_Pos)   /*!< Interface captures second line from the frame
                                                                     start, first one is dropped */
/**
  * @}
  */
/**
  * @}
  */

/** @defgroup DCMIPP_Pipe_Byte_Decimation DCMIPP Pipe Byte Decimation
  * @{
  */
/** @defgroup DCMIPP_Byte_Select_Mode DCMIPP Byte Select Mode
  * @{
  */
#define DCMIPP_BSM_ALL          0U                              /*!< Interface captures all received data */
#define DCMIPP_BSM_DATA_OUT_2  (1U << DCMIPP_P0PPCR_BSM_Pos)    /*!< Interface captures 1 data out of 2   */
#define DCMIPP_BSM_BYTE_OUT_4  (2U << DCMIPP_P0PPCR_BSM_Pos)    /*!< Interface captures 1 byte out of 4   */
#define DCMIPP_BSM_2BYTE_OUT_4 (3U << DCMIPP_P0PPCR_BSM_Pos)    /*!< Interface captures 2 byte out of 4   */
/**
  * @}
  */
/** @defgroup DCMIPP_Byte_Start_Mode DCMIPP Byte Start Mode
  * @{
  */
#define DCMIPP_OEBS_ODD        0U                              /*!< Interface captures first data (byte or double byte)
                                                                   from the frame/line start,second one being dropped */
#define DCMIPP_OEBS_EVEN      (1U << DCMIPP_P0PPCR_OEBS_Pos)   /*!< Interface captures second data (byte or double byte)
                                                                    from the frame/line start, first one is dropped   */
/**
  * @}
  */
/**
  * @}
  */

/** @defgroup DCMIPP_Memory DCMIPP Memory
  * @{
  */
#define DCMIPP_MEMORY_ADDRESS_0 0U   /*!< Base destination address   */
#define DCMIPP_MEMORY_ADDRESS_1 1U   /*!< Second destination address */
/**
  * @}
  */
/** @defgroup DCMIPP_LineMult DCMIPP Line Mult
  * @{
  */
#define  DCMIPP_MULTILINE_1_LINE      0U                                  /*!< Event after every 1   line   */
#define  DCMIPP_MULTILINE_2_LINES    (1U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 2   lines  */
#define  DCMIPP_MULTILINE_4_LINES    (2U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 4   lines  */
#define  DCMIPP_MULTILINE_8_LINES    (3U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 8   lines  */
#define  DCMIPP_MULTILINE_16_LINES   (4U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 16  lines  */
#define  DCMIPP_MULTILINE_32_LINES   (5U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 32  lines  */
#define  DCMIPP_MULTILINE_64_LINES   (6U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 64  lines  */
#define  DCMIPP_MULTILINE_128_LINES  (7U << DCMIPP_P0PPCR_LINEMULT_Pos)   /*!< Event after every 128 lines  */
/**
  * @}
  */
/** @defgroup DCMIPP_LineWrapAddress DCMIPP line Wrap Address
  * @{
  */
#define  DCMIPP_WRAP_ADDRESS_1_LINE     (0U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 1   line   */
#define  DCMIPP_WRAP_ADDRESS_2_LINES    (1U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 2   lines  */
#define  DCMIPP_WRAP_ADDRESS_4_LINES    (2U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 4   lines  */
#define  DCMIPP_WRAP_ADDRESS_8_LINES    (3U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 8   lines  */
#define  DCMIPP_WRAP_ADDRESS_16_LINES   (4U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 16  lines  */
#define  DCMIPP_WRAP_ADDRESS_32_LINES   (5U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 32  lines  */
#define  DCMIPP_WRAP_ADDRESS_64_LINES   (6U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 64  lines  */
#define  DCMIPP_WRAP_ADDRESS_128_LINES  (7U << DCMIPP_P1PPCR_LMAWM_Pos)  /*!< Wraps address after 128 lines  */
/**
  * @}
  */

/** @defgroup DCMIPP_PIPE_Vertical_Decimation_Ratio DCMIPP Pipe Vertical Decimation Ratio
  * @{
  */

#define  DCMIPP_VDEC_ALL       0U                              /*!< All lines captured , no vertical decimation */
#define  DCMIPP_VDEC_1_OUT_2  (1U << DCMIPP_P1DECR_VDEC_Pos)   /*!< One line out of two transmitted             */
#define  DCMIPP_VDEC_1_OUT_4  (2U << DCMIPP_P1DECR_VDEC_Pos)   /*!< One line out of four transmitted            */
#define  DCMIPP_VDEC_1_OUT_8  (3U << DCMIPP_P1DECR_VDEC_Pos)   /*!< One line out of eight transmitted           */

/**
  * @}
  */

/** @defgroup DCMIPP_PIPE_Horizontal_Decimation_Ratio DCMIPP Pipe Horizontal Decimation Ratio
  * @{
  */
#define  DCMIPP_HDEC_ALL       0U                              /*!< All pixels captured , no horizontal decimation */
#define  DCMIPP_HDEC_1_OUT_2  (1U << DCMIPP_P1DECR_HDEC_Pos)   /*!< One line out of two transmitted                */
#define  DCMIPP_HDEC_1_OUT_4  (2U << DCMIPP_P1DECR_HDEC_Pos)   /*!< One line out of four transmitted               */
#define  DCMIPP_HDEC_1_OUT_8  (3U << DCMIPP_P1DECR_HDEC_Pos)   /*!< One line out of eight transmitted              */
/**
  * @}
  */

