micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
/** @defgroup DCMIPP_Pixel_Packer_Format  DCMIPP Pixel Packer Format
  * @{
  */
#define  DCMIPP_PIXEL_PACKER_FORMAT_RGB888_YUV444_1  0U                                /*!< RGB888 or YUV422 1-buffer*/
#define  DCMIPP_PIXEL_PACKER_FORMAT_RGB565_1        (1U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< RGB565 1-buffer          */
#define  DCMIPP_PIXEL_PACKER_FORMAT_ARGB8888        (2U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< ARGB888  A=0xff          */
#define  DCMIPP_PIXEL_PACKER_FORMAT_RGBA888         (3U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< RGBA888  A=0xff)         */
#define  DCMIPP_PIXEL_PACKER_FORMAT_MONO_Y8_G8_1    (4U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< Monochrome Y8 or G8      */
#define  DCMIPP_PIXEL_PACKER_FORMAT_YUV444_1        (5U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< YUV444 1-buffer 32bpp
                                                                                            A=0xff)                  */
#define  DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1        (6U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< YUV422 1-buffer 16bpp    */
#define  DCMIPP_PIXEL_PACKER_FORMAT_YUV422_2        (7U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< YUV422 2-buffer 16bpp    */
#define  DCMIPP_PIXEL_PACKER_FORMAT_YUV420_2        (8U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< YUV420 2-buffer 12bpp    */
#define  DCMIPP_PIXEL_PACKER_FORMAT_YUV420_3        (9U << DCMIPP_P1PPCR_FORMAT_Pos)   /*!< YUV420 3-buffer 12bpp    */
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Mode  DCMIPP Statistics extraction Mode
  * @{
  */
#define  DCMIPP_STAT_EXT_MODE_AVERAGE   0U                               /*!< Values of pixels are accumulated as-is */
#define  DCMIPP_STAT_EXT_MODE_BINS     (1U << DCMIPP_P1ST1CR_MODE_Pos)   /*!< Values of pixels are used to see
                                                                              if the pixel fits one of the 12 bins.*/
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Module_ID  DCMIPP Statistics Extraction Module ID
  * @{
  */
#define DCMIPP_STATEXT_MODULE1  1U /*!< Statistic Extraction Module 1 */
#define DCMIPP_STATEXT_MODULE2  2U /*!< Statistic Extraction Module 2 */
#define DCMIPP_STATEXT_MODULE3  3U /*!< Statistic Extraction Module 3 */
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Source  DCMIPP Statistics extraction Source
  * @{
  */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_R   0U                              /*!< Statistics Extraction Source : Red
                                                           is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_G  (1U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Green
                                                           is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_B  (2U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Blue
                                                           is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_L  (3U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source :
                                                 Luminance is sampled before the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_R  (4U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Red
                                                            is sampled after the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_G  (5U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Green
                                                            is sampled after the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_B  (6U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source : Blue
                                                            is sampled after the black level calibration and exposure */
#define  DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_L  (7U << DCMIPP_P1ST1CR_SRC_Pos) /*!< Statistics Extraction Source :
                                                  Luminance is sampled after the black level calibration and exposure */
/**
  * @}
  */

/** @defgroup DCMIPP_Statistics_Extraction_Bins  DCMIPP Statistics extraction Bins
  * @{
  */
#define  DCMIPP_STAT_EXT_BINS_MODE_LOWER_BINS   0U                               /*!< LowerBins: Accu0 (1, 2)
                                                                                      is incremented of 256 if
                                                                                      Component <4 (<8, <16) */
#define  DCMIPP_STAT_EXT_BINS_MODE_LOWMID_BINS (1U << DCMIPP_P1ST1CR_BINS_Pos) /*!< LowMid Bins: Accu0 (1, 2)
                                                                                      is incremented of 256 if
                                                                                      Component <32 (<64, <128) */
#define  DCMIPP_STAT_EXT_BINS_MODE_UPMID_BINS  (2U << DCMIPP_P1ST1CR_BINS_Pos) /*!< UpMid Bins: Accu0 (1, 2) is
                                                                                      incremented of 256 if
                                                                                      Component >127 (>191, >224) */
#define  DCMIPP_STAT_EXT_BINS_MODE_UP_BINS     (3U << DCMIPP_P1ST1CR_BINS_Pos) /*!< UpBins: Accu0 (1, 2) is
                                                                                      incremented of 256 if
                                                                                      Component >239 (>247, >251)
                                                                                      Condition: MODE = Average */
#define  DCMIPP_STAT_EXT_AVER_MODE_ALL_PIXELS  (0U << DCMIPP_P1ST1CR_BINS_Pos) /*!< All Pixels: Accu is incremented of
                                                                                   Component, if 0 <= Component < 256 */
#define  DCMIPP_STAT_EXT_AVER_MODE_NOEXT16     (1U << DCMIPP_P1ST1CR_BINS_Pos) /*!< NoExt16: Accu is incremented of
                                                                                  Component, if 16 <= Component < 240 */
#define  DCMIPP_STAT_EXT_AVER_MODE_NOEXT32     (2U << DCMIPP_P1ST1CR_BINS_Pos) /*!< NoExt32: Accu is incremented of
                                                                                  Component, if 32 <= Component < 224 */
#define  DCMIPP_STAT_EXT_AVER_MODE_NOEXT64     (3U << DCMIPP_P1ST1CR_BINS_Pos) /*!< NoExt64: Accu is incremented of
                                                                                  Component, if 64 <= Component < 192 */
/**
  * @}
  */

/**
  * @defgroup  DCMIPP_RAWBayer2RGB_Strength DCMIPP RAWBayer2RGB Strength
  * @{
  */
#define  DCMIPP_RAWBAYER_ALGO_NONE        0U   /*!< No edge detection, pure linear interpolation */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_3  1U   /*!< RawBayer relative algorithm strength 3       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_4  2U   /*!< RawBayer relative algorithm strength 4       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_6  3U   /*!< RawBayer relative algorithm strength 6       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_8  4U   /*!< RawBayer relative algorithm strength 8       */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_12 5U   /*!< RawBayer relative algorithm strength 12      */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_16 6U   /*!< RawBayer relative algorithm strength 16      */
#define  DCMIPP_RAWBAYER_ALGO_STRENGTH_24 7U   /*!< RawBayer relative algorithm strength 24      */

/**
  * @}
  */

/**
  * @defgroup  DCMIPP_RAWBayer2RGB_Type DCMIPP RAWBayer2RGB Type
  * @{
  */
#define  DCMIPP_RAWBAYER_RGGB   0U                               /*!<Raw Bayer Type RGGB */
#define  DCMIPP_RAWBAYER_GRBG  (1U << DCMIPP_P1DMCR_TYPE_Pos)    /*!<Raw Bayer Type GRBG */
#define  DCMIPP_RAWBAYER_GBRG  (2U << DCMIPP_P1DMCR_TYPE_Pos)    /*!<Raw Bayer Type GBRG */
#define  DCMIPP_RAWBAYER_BGGR  (3U << DCMIPP_P1DMCR_TYPE_Pos)    /*!<Raw Bayer Type BGGR */
/**
  * @}
  */

/** @defgroup DCMIPP_Bad_Pixel_Removal_Strength  DCMIPP Bad Pixel Removal Strength
  * @{
  */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_0  0U   /*!< The filter is fairly tolerant: only a
                                                  few pixels are declared bad, due to
                                                  their high noise */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_1  1U   /*!< Bad Pixel detection strength 1 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_2  2U   /*!< Bad Pixel detection strength 2 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_3  3U   /*!< Bad Pixel detection strength 3 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_4  4U   /*!< Bad Pixel detection strength 4 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_5  5U   /*!< Bad Pixel detection strength 5 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_6  6U   /*!< Bad Pixel detection strength 6 */
#define  DCMIPP_BAD_PXL_REM_SRENGTH_7  7U   /*!< Bad Pixel detection strength 7 */
/**
  * @}
  */

