micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
/** @defgroup DCMIPP_Region_Of_Interest  DCMIPP Region Of Interest
  * @{
  */
#define DCMIPP_REGION_OF_INTEREST1  1U  /*!< Region Of Interest 1 */
#define DCMIPP_REGION_OF_INTEREST2  2U  /*!< Region Of Interest 2 */
#define DCMIPP_REGION_OF_INTEREST3  3U  /*!< Region Of Interest 3 */
#define DCMIPP_REGION_OF_INTEREST4  4U  /*!< Region Of Interest 4 */
#define DCMIPP_REGION_OF_INTEREST5  5U  /*!< Region Of Interest 5 */
#define DCMIPP_REGION_OF_INTEREST6  6U  /*!< Region Of Interest 6 */
#define DCMIPP_REGION_OF_INTEREST7  7U  /*!< Region Of Interest 7 */
#define DCMIPP_REGION_OF_INTEREST8  8U  /*!< Region Of Interest 8 */
/**
  * @}
  */

/** @defgroup DCMIPP_Region_Of_Interest_Line_Width  DCMIPP Region Of Interest Line Width
  * @{
  */
#define DCMIPP_LINE_WIDTH_1PXL 0U    /*!< Line width 1 pixel  */
#define DCMIPP_LINE_WIDTH_2PXL 1U    /*!< Line width 2 pixels */
#define DCMIPP_LINE_WIDTH_4PXL 2U    /*!< Line width 4 pixels */
#define DCMIPP_LINE_WIDTH_8PXL 3U    /*!< Line width 8 pixels */
/**
  * @}
  */

/** @defgroup DCMIPP_Multiply  DCMIPP Multiply
  * @{
  */
#define DCMIPP_MULTIPY_BY_1 0U   /*!< DCMIPP multiply R/G/B by 1 */
#define DCMIPP_MULTIPY_BY_2 1U   /*!< DCMIPP multiply R/G/B by 2 */
#define DCMIPP_MULTIPY_BY_4 2U   /*!< DCMIPP multiply R/G/B by 4 */
#define DCMIPP_MULTIPY_BY_8 3U   /*!< DCMIPP multiply R/G/B by 8 */
/**
  * @}
  */

/** @defgroup DCMIPP_Interrupt_Sources  DCMIPP Interrupt sources
  * @{
  */
#define DCMIPP_IT_AXI_TRANSFER_ERROR  DCMIPP_CMIER_ATXERRIE  /*!< IPPLUG AXI Transfer error interrupt        */
#define DCMIPP_IT_PARALLEL_SYNC_ERROR DCMIPP_CMIER_PRERRIE   /*!< Sync error interrupt on parallel interface */
#define DCMIPP_IT_PIPE0_FRAME         DCMIPP_CMIER_P0FRAMEIE /*!< Frame capture interrupt complete for pipe0 */
#define DCMIPP_IT_PIPE0_VSYNC         DCMIPP_CMIER_P0VSYNCIE /*!< Vertical sync interrupt for pipe0          */
#define DCMIPP_IT_PIPE0_LINE          DCMIPP_CMIER_P0LINEIE  /*!< Multiline interrupt for pipe0              */
#define DCMIPP_IT_PIPE0_LIMIT         DCMIPP_CMIER_P0LIMITIE /*!< Limit interrupt for pipe0                  */
#define DCMIPP_IT_PIPE0_OVR           DCMIPP_CMIER_P0OVRIE   /*!< Overrun interrupt for pipe0                */
#define DCMIPP_IT_PIPE1_LINE          DCMIPP_CMIER_P1LINEIE  /*!< Multiline capture interrupt for pipe1      */
#define DCMIPP_IT_PIPE1_FRAME         DCMIPP_CMIER_P1FRAMEIE /*!< Frame capture interrupt complete for pipe1 */
#define DCMIPP_IT_PIPE1_VSYNC         DCMIPP_CMIER_P1VSYNCIE /*!< Vertical sync interrupt for pipe1          */
#define DCMIPP_IT_PIPE1_OVR           DCMIPP_CMIER_P1OVRIE   /*!< Overrun interrupt for pipe1                */
#define DCMIPP_IT_PIPE2_LINE          DCMIPP_CMIER_P2LINEIE  /*!< Multiline capture interrupt for pipe2      */
#define DCMIPP_IT_PIPE2_FRAME         DCMIPP_CMIER_P2FRAMEIE /*!< Frame capture interrupt complete for pipe2 */
#define DCMIPP_IT_PIPE2_VSYNC         DCMIPP_CMIER_P2VSYNCIE /*!< Vertical synch interrupt for pipe2         */
#define DCMIPP_IT_PIPE2_OVR           DCMIPP_CMIER_P2OVRIE   /*!< Overrun interrupt for pipe2                */
/**
  * @}
  */

/** @defgroup DCMIPP_Interrupt_Flags  DCMIPP Interrupt Flags
  * @{
  */
#define DCMIPP_FLAG_AXI_TRANSFER_ERROR  DCMIPP_CMSR2_ATXERRF /*!< IPPLUG AXI Transfer error interrupt flag            */
#define DCMIPP_FLAG_PARALLEL_SYNC_ERROR DCMIPP_CMSR2_PRERRF  /*!< Synchronization error interrupt on parallel interface
                                                                  flag */
#define DCMIPP_FLAG_PIPE0_FRAME       DCMIPP_CMSR2_P0FRAMEF  /*!< Frame capture interrupt complete for pipe0 flag     */
#define DCMIPP_FLAG_PIPE0_VSYNC       DCMIPP_CMSR2_P0VSYNCF  /*!< Vertical synch interrupt for pipe0 flag             */
#define DCMIPP_FLAG_PIPE0_LINE        DCMIPP_CMSR2_P0LINEF   /*!< Multiline interrupt for pipe0 flag                  */
#define DCMIPP_FLAG_PIPE0_LIMIT       DCMIPP_CMSR2_P0LIMITF  /*!< Limit interrupt for pipe0 flag                      */
#define DCMIPP_FLAG_PIPE0_OVR         DCMIPP_CMSR2_P0OVRF    /*!< Overrun interrupt for pipe0 flag                    */
#define DCMIPP_FLAG_PIPE1_LINE        DCMIPP_CMSR2_P1LINEF   /*!< Multiline capture interrupt for pipe1 flag          */
#define DCMIPP_FLAG_PIPE1_FRAME       DCMIPP_CMSR2_P1FRAMEF  /*!< Frame capture interrupt complete for pipe1 flag     */
#define DCMIPP_FLAG_PIPE1_VSYNC       DCMIPP_CMSR2_P1VSYNCF  /*!< Vertical synch interrupt for pipe1 flag             */
#define DCMIPP_FLAG_PIPE1_OVR         DCMIPP_CMSR2_P1OVRF    /*!< Overrun interrupt for pipe1 flag                    */
#define DCMIPP_FLAG_PIPE2_LINE        DCMIPP_CMSR2_P2LINEF   /*!< Multiline capture interrupt for pipe2 flag          */
#define DCMIPP_FLAG_PIPE2_FRAME       DCMIPP_CMSR2_P2FRAMEF  /*!< Frame capture interrupt complete for pipe2 flag     */
#define DCMIPP_FLAG_PIPE2_VSYNC       DCMIPP_CMSR2_P2VSYNCF  /*!< Vertical synch interrupt for pipe2 flag             */
#define DCMIPP_FLAG_PIPE2_OVR         DCMIPP_CMSR2_P2OVRF    /*!< Overrun interrupt for pipe2 flag                    */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_Interrupt_Sources  DCMIPP CSI Interrupt sources
  * @{
  */
#define DCMIPP_CSI_IT_SYNCERR      CSI_IER0_SYNCERRIE     /*!< Synchronization error interrupt                    */
#define DCMIPP_CSI_IT_WDERR        CSI_IER0_WDERRIE       /*!< Watchdog error interrupt                           */
#define DCMIPP_CSI_IT_SPKTERR      CSI_IER0_SPKTERRIE     /*!< Shorter packet than expected error interrupt       */
#define DCMIPP_CSI_IT_IDERR        CSI_IER0_IDERRIE       /*!< Data ID information error interrupt                */
#define DCMIPP_CSI_IT_CECCERR      CSI_IER0_CECCERRIE     /*!< Corrected ECC error interrupt                      */
#define DCMIPP_CSI_IT_ECCERR       CSI_IER0_ECCERRIE      /*!< ECC Error interrupt                                */
#define DCMIPP_CSI_IT_CRCERR       CSI_IER0_CRCERRIE      /*!< CRC Error interrupt                                */
#define DCMIPP_CSI_IT_CCFIFO       CSI_IER0_CCFIFOFIE     /*!< Clock changer FIFO full event interrupt            */
#define DCMIPP_CSI_IT_SPKT         CSI_IER0_SPKTIE        /*!< Short packet detection interrupt                   */
#define DCMIPP_CSI_IT_EOF3         CSI_IER0_EOF3IE        /*!< EOF on virtual channel 3 interrupt                 */
#define DCMIPP_CSI_IT_EOF2         CSI_IER0_EOF2IE        /*!< EOF on virtual channel 2 interrupt                 */
#define DCMIPP_CSI_IT_EOF1         CSI_IER0_EOF1IE        /*!< EOF on virtual channel 1 interrupt                 */
#define DCMIPP_CSI_IT_EOF0         CSI_IER0_EOF0IE        /*!< EOF on virtual channel 0 interrupt                 */
#define DCMIPP_CSI_IT_SOF3         CSI_IER0_SOF3IE        /*!< SOF on virtual channel 3 interrupt                 */
#define DCMIPP_CSI_IT_SOF2         CSI_IER0_SOF2IE        /*!< SOF on virtual channel 2 interrupt                 */
#define DCMIPP_CSI_IT_SOF1         CSI_IER0_SOF1IE        /*!< SOF on virtual channel 1 interrupt                 */
#define DCMIPP_CSI_IT_SOF0         CSI_IER0_SOF0IE        /*!< SOF on virtual channel 0 interrupt                 */
#define DCMIPP_CSI_IT_TIM3         CSI_IER0_TIM3IE        /*!< Timer 3 counter value reached interrupt            */
#define DCMIPP_CSI_IT_TIM2         CSI_IER0_TIM2IE        /*!< Timer 2 counter value reached interrupt            */
#define DCMIPP_CSI_IT_TIM1         CSI_IER0_TIM1IE        /*!< Timer 1 counter value reached interrupt            */
#define DCMIPP_CSI_IT_TIM0         CSI_IER0_TIM0IE        /*!< Timer 0 counter value reached interrupt            */
#define DCMIPP_CSI_IT_LB3          CSI_IER0_LB3IE         /*!< Line/byte event 3 reached interrupt                */
#define DCMIPP_CSI_IT_LB2          CSI_IER0_LB2IE         /*!< Line/byte event 2 reached interrupt                */
#define DCMIPP_CSI_IT_LB1          CSI_IER0_LB1IE         /*!< Line/byte event 1 reached interrupt                */
#define DCMIPP_CSI_IT_LB0          CSI_IER0_LB0IE         /*!< Line/byte event 0 reached interrupt                */
#define DCMIPP_CSI_IT_ECTRLDL1     CSI_IER1_ECTRLDL1IE    /*!< Error control on data line 1 interrupt             */
#define DCMIPP_CSI_IT_ESYNCESCDL1  CSI_IER1_ESYNCESCDL1IE /*!< Low-power data transmission synchronization error on
                                                               data line 1 interrupt                              */
#define DCMIPP_CSI_IT_EESCDL1      CSI_IER1_EESCDL1IE     /*!< Escape entry error on data line 1 interrupt        */
#define DCMIPP_CSI_IT_ESOTSYNCDL1  CSI_IER1_ESOTSYNCDL1IE /*!< SOT synchronization error on data line 1 interrupt */
#define DCMIPP_CSI_IT_ESOTDL1      CSI_IER1_ESOTDL1IE     /*!< SOT error on data line 1 interrupt                 */
#define DCMIPP_CSI_IT_ECTRLDL0     CSI_IER1_ECTRLDL0IE    /*!< Error control on data line 0 interrupt             */
#define DCMIPP_CSI_IT_ESYNCESCDL0  CSI_IER1_ESYNCESCDL0IE /*!< Low-power data transmission synchronization error on
                                                               data line 0 interrupt                               */
#define DCMIPP_CSI_IT_EESCDL0      CSI_IER1_EESCDL0IE     /*!< Escape entry error on data line 0 interrupt        */
#define DCMIPP_CSI_IT_ESOTSYNCDL0  CSI_IER1_ESOTSYNCDL0IE /*!< SOT synchronization error on data line 0 interrupt */
#define DCMIPP_CSI_IT_ESOTDL0      CSI_IER1_ESOTDL0IE     /*!< SOT error on data line 0 interrupt                 */
/**
  * @}
  */
/** @defgroup DCMIPP_CSI_Interrupt_Flags  DCMIPP CSI Interrupt Flags
  * @{
  */
#define DCMIPP_CSI_FLAG_SYNCERR      CSI_SR0_SYNCERRF      /*!< Synchronization error flag                        */
#define DCMIPP_CSI_FLAG_WDERR        CSI_SR0_WDERRF        /*!< Watchdog error flag                               */
#define DCMIPP_CSI_FLAG_SPKTERR      CSI_SR0_SPKTERRF      /*!< Shorter packet than expected error flag           */
#define DCMIPP_CSI_FLAG_IDERR        CSI_SR0_IDERRF        /*!< Data ID information error flag                    */
#define DCMIPP_CSI_FLAG_CECCERR      CSI_SR0_CECCERRF      /*!< Corrected ECC error flag                          */
#define DCMIPP_CSI_FLAG_ECCERR       CSI_SR0_ECCERRF       /*!< ECC Error flag                                    */
#define DCMIPP_CSI_FLAG_CRCERR       CSI_SR0_CRCERRF       /*!< CRC Error flag                                    */
#define DCMIPP_CSI_FLAG_CCFIFO       CSI_SR0_CCFIFOFF      /*!< Clock changer FIFO full event flag                */
#define DCMIPP_CSI_FLAG_SPKT         CSI_SR0_SPKTF         /*!< Short packet detection flag                       */
#define DCMIPP_CSI_FLAG_EOF3         CSI_SR0_EOF3F         /*!< EOF on virtual channel 3 flag                     */
#define DCMIPP_CSI_FLAG_EOF2         CSI_SR0_EOF2F         /*!< EOF on virtual channel 2 flag                     */
#define DCMIPP_CSI_FLAG_EOF1         CSI_SR0_EOF1F         /*!< EOF on virtual channel 1 flag                     */
#define DCMIPP_CSI_FLAG_EOF0         CSI_SR0_EOF0F         /*!< EOF on virtual channel 0 flag                     */
#define DCMIPP_CSI_FLAG_SOF3         CSI_SR0_SOF3F         /*!< SOF on virtual channel 3 flag                     */
#define DCMIPP_CSI_FLAG_SOF2         CSI_SR0_SOF2F         /*!< SOF on virtual channel 2 flag                     */
#define DCMIPP_CSI_FLAG_SOF1         CSI_SR0_SOF1F         /*!< SOF on virtual channel 1 flag                     */
#define DCMIPP_CSI_FLAG_SOF0         CSI_SR0_SOF0F         /*!< SOF on virtual channel 0 flag                     */
#define DCMIPP_CSI_FLAG_TIM3         CSI_SR0_TIM3F         /*!< Timer 3 counter value reached flag                */
#define DCMIPP_CSI_FLAG_TIM2         CSI_SR0_TIM2F         /*!< Timer 2 counter value reached flag                */
#define DCMIPP_CSI_FLAG_TIM1         CSI_SR0_TIM1F         /*!< Timer 1 counter value reached flag                */
#define DCMIPP_CSI_FLAG_TIM0         CSI_SR0_TIM0F         /*!< Timer 0 counter value reached flag                */
#define DCMIPP_CSI_FLAG_LB3          CSI_SR0_LB3F          /*!< Line/byte event 3 reached  flag                   */
#define DCMIPP_CSI_FLAG_LB2          CSI_SR0_LB2F          /*!< Line/byte event 2 reached  flag                   */
#define DCMIPP_CSI_FLAG_LB1          CSI_SR0_LB1F          /*!< Line/byte event 1 reached  flag                   */
#define DCMIPP_CSI_FLAG_LB0          CSI_SR0_LB0F          /*!< Line/byte event 0 reached  flag                   */
#define DCMIPP_CSI_FLAG_ECTRLDL1     CSI_SR1_ECTRLDL1F     /*!< Error control on data line 1 flag             */
#define DCMIPP_CSI_FLAG_ESYNCESCDL1  CSI_SR1_ESYNCESCDL1F  /*!< Low-power data transmission synchronization
                                                                error on data line 1 flag                     */
#define DCMIPP_CSI_FLAG_EESCDL1      CSI_SR1_EESCDL1F      /*!< Escape entry error on data line 1 flag        */
#define DCMIPP_CSI_FLAG_ESOTSYNCDL1  CSI_SR1_ESOTSYNCDL1F  /*!< SOT synchronization error on data line 1 flag */
#define DCMIPP_CSI_FLAG_ESOTDL1      CSI_SR1_ESOTDL1F      /*!< SOT error on data line 1 flag                 */
#define DCMIPP_CSI_FLAG_ECTRLDL0     CSI_SR1_ECTRLDL0F     /*!< Error control on data line 0 flag             */
#define DCMIPP_CSI_FLAG_ESYNCESCDL0  CSI_SR1_ESYNCESCDL0F  /*!< Low-power data transmission synchronization
                                                                error on data line 0 flag                     */
#define DCMIPP_CSI_FLAG_EESCDL0      CSI_SR1_EESCDL0F      /*!< Escape entry error on data line 0 flag        */
#define DCMIPP_CSI_FLAG_ESOTSYNCDL0  CSI_SR1_ESOTSYNCDL0F  /*!< SOT synchronization error on data line 0 flag */
#define DCMIPP_CSI_FLAG_ESOTDL0      CSI_SR1_ESOTDL0F      /*!< SOT error on data line 0 flag                 */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DCMIPP_Exported_Macros DCMIPP Exported Macros
  * @brief    DCMIPP Exported Macros
  * @{
  */
/**
  * @brief  Enable the specified DCMIPP interrupts.
  * @param  __HANDLE__    DCMIPP handle
  * @param  __INTERRUPT__ specifies the DCMIPP interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_IT_AXI_TRANSFER_ERR IPPLUG AXI Transfer error interrupt
  *            @arg DCMIPP_IT_PARALLEL_SYNC_ERR Synchronization error interrupt on parallel interface
  *            @arg DCMIPP_IT_PIPE0_FRAME Frame capture complete interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_VSYNC Vertical sync interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_LINE Multi-line capture complete interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_LIMIT Limit interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_OVR Overrun interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE1_LINE Multi-line capture complete interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_FRAME Frame capture complete interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_VSYNC Vertical sync interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_OVR Overrun interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE2_LINE Multi-line capture complete interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_FRAME Frame capture complete interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_VSYNC Vertical sync interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_OVR Overrun interrupt for the pipe2
  * @retval None
  */
#define __HAL_DCMIPP_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->CMIER |= (__INTERRUPT__))

/**
  * @brief  Disable the specified DCMIPP interrupts.
  * @param  __HANDLE__    DCMIPP handle
  * @param  __INTERRUPT__ specifies the DCMIPP interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_IT_AXI_TRANSFER_ERR IPPLUG AXI Transfer error interrupt
  *            @arg DCMIPP_IT_PARALLEL_SYNC_ERR Synchronization error interrupt on parallel interface
  *            @arg DCMIPP_IT_PIPE0_FRAME Frame capture complete interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_VSYNC Vertical sync interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_LINE Multi-line capture complete interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_LIMIT Limit interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_OVR Overrun interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE1_LINE Multi-line capture complete interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_FRAME Frame capture complete interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_VSYNC Vertical sync interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_OVR Overrun interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE2_LINE Multi-line capture complete interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_FRAME Frame capture complete interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_VSYNC Vertical sync interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_OVR Overrun interrupt for the pipe2
  * @retval None
  */
#define __HAL_DCMIPP_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->CMIER &= ~(__INTERRUPT__))

/**
  * @brief  Get the DCMIPP pending interrupt flags.
  * @param  __HANDLE__ DCMIPP handle
  * @param  __FLAG__   Get the specified flag.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_FLAG_AXI_TRANSFER_ERR IPPLUG AXI Transfer error interrupt flag
  *            @arg DCMIPP_FLAG_PARALLEL_SYNC_ERR Synchronization error interrupt flag on parallel interface
  *            @arg DCMIPP_FLAG_PIPE0_FRAME Frame capture complete interrupt flag for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_VSYNC Vertical sync interrupt flag for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_LINE Multi-line capture complete interrupt flag for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_LIMIT Limit interrupt flag for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_OVR Overrun interrupt flag for the pipe0
  *            @arg DCMIPP_FLAG_PIPE1_LINE Multi-line capture complete interrupt flag for the pipe1
  *            @arg DCMIPP_FLAG_PIPE1_FRAME Frame capture complete interrupt flag for the pipe1
  *            @arg DCMIPP_FLAG_PIPE1_VSYNC Vertical sync interrupt flag for the pipe1
  *            @arg DCMIPP_FLAG_PIPE1_OVR Overrun interrupt flag for the pipe1
  *            @arg DCMIPP_FLAG_PIPE2_LINE Multi-line capture complete interrupt flag for the pipe2
  *            @arg DCMIPP_FLAG_PIPE2_FRAME Frame capture complete interrupt flag for the pipe2
  *            @arg DCMIPP_FLAG_PIPE2_VSYNC Vertical sync interrupt flag for the pipe2
  *            @arg DCMIPP_FLAG_PIPE2_OVR Overrun interrupt flag for the pipe2
  * @retval The state of FLAG (SET or RESET).
  */
#define __HAL_DCMIPP_GET_FLAG(__HANDLE__, __FLAG__)  ((__HANDLE__)->Instance->CMSR2 & (__FLAG__))

/**
  * @brief  Clear the DCMIPP pending interrupt flags.
  * @param  __HANDLE__ DCMIPP handle
  * @param  __FLAG__   specifies the flag to clear.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_FLAG_AXI_TRANSFER_ERR IPPLUG AXI Transfer error interrupt
  *            @arg DCMIPP_FLAG_PARALLEL_SYNC_ERR Synchronization error interrupt on parallel interface
  *            @arg DCMIPP_FLAG_PIPE0_FRAME Frame capture complete interrupt for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_VSYNC Vertical sync interrupt for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_LINE Multi-line capture complete interrupt for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_LIMIT Limit interrupt for the pipe0
  *            @arg DCMIPP_FLAG_PIPE0_OVR Overrun interrupt for the pipe0
  *            @arg DCMIPP_FLAG_PIPE1_LINE Multi-line capture complete interrupt for the pipe1
  *            @arg DCMIPP_FLAG_PIPE1_FRAME Frame capture complete interrupt for the pipe1
  *            @arg DCMIPP_FLAG_PIPE1_VSYNC Vertical sync interrupt for the pipe1
  *            @arg DCMIPP_FLAG_PIPE1_OVR Overrun interrupt for the pipe1
  *            @arg DCMIPP_FLAG_PIPE2_LINE Multi-line capture complete interrupt for the pipe2
  *            @arg DCMIPP_FLAG_PIPE2_FRAME Frame capture complete interrupt for the pipe2
  *            @arg DCMIPP_FLAG_PIPE2_VSYNC Vertical sync interrupt for the pipe2
  *            @arg DCMIPP_FLAG_PIPE2_OVR Overrun interrupt for the pipe2
  * @retval None
  */
#define __HAL_DCMIPP_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->CMFCR = (__FLAG__))

/**
  * @brief  Checks whether the specified DCMIPP interrupt is enabled or not.
  * @param  __HANDLE__    DCMIPP handle
  * @param  __INTERRUPT__ specifies the DCMIPP interrupt sources to be checked.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_IT_AXI_TRANSFER_ERR IPPLUG AXI Transfer error interrupt
  *            @arg DCMIPP_IT_PARALLEL_SYNC_ERR Synchronization error interrupt on parallel interface
  *            @arg DCMIPP_IT_PIPE0_FRAME Frame capture complete interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_VSYNC Vertical sync interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_LINE Multi-line capture complete interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_LIMIT Limit interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE0_OVR Overrun interrupt for the pipe0
  *            @arg DCMIPP_IT_PIPE1_LINE Multi-line capture complete interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_FRAME Frame capture complete interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_VSYNC Vertical sync interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE1_OVR Overrun interrupt for the pipe1
  *            @arg DCMIPP_IT_PIPE2_LINE Multi-line capture complete interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_FRAME Frame capture complete interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_VSYNC Vertical sync interrupt for the pipe2
  *            @arg DCMIPP_IT_PIPE2_OVR Overrun interrupt for the pipe2
  * @retval The state of DCMIPP interrupt (SET or RESET).
  */
#define __HAL_DCMIPP_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->Instance->CMIER & \
                                                                 (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

