micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
/**
  * @brief  Enable the specified DCMIPP CSI interrupts.
  * @param  __HANDLE__    CSI handle
  * @param  __INTERRUPT__ specifies the DCMIPP CSI interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_IT_SYNCERR Synchronization error interrupt
  *            @arg DCMIPP_CSI_IT_WDERR   Watchdog error interrupt
  *            @arg DCMIPP_CSI_IT_SPKTERR Shorter packet than expected error interrupt
  *            @arg DCMIPP_CSI_IT_IDERR   Data ID information error interrupt
  *            @arg DCMIPP_CSI_IT_CECCERR Corrected ECC error interrupt
  *            @arg DCMIPP_CSI_IT_ECCERR  ECC Error interrupt
  *            @arg DCMIPP_CSI_IT_CRCERR  CRC Error interrupt
  *            @arg DCMIPP_CSI_IT_CCFIFO  Clock changer FIFO full event interrupt
  *            @arg DCMIPP_CSI_IT_SPKT    Short packet detection interrupt
  *            @arg DCMIPP_CSI_IT_EOF3    EOF on virtual channel 3 interrupt
  *            @arg DCMIPP_CSI_IT_EOF2    EOF on virtual channel 2 interrupt
  *            @arg DCMIPP_CSI_IT_EOF1    EOF on virtual channel 1 interrupt
  *            @arg DCMIPP_CSI_IT_EOF0    EOF on virtual channel 0 interrupt
  *            @arg DCMIPP_CSI_IT_SOF3    SOF on virtual channel 3 interrupt
  *            @arg DCMIPP_CSI_IT_SOF2    SOF on virtual channel 2 interrupt
  *            @arg DCMIPP_CSI_IT_SOF1    SOF on virtual channel 1 interrupt
  *            @arg DCMIPP_CSI_IT_SOF0    SOF on virtual channel 0 interrupt
  *            @arg DCMIPP_CSI_IT_TIM3    Timer 3 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM2    Timer 2 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM1    Timer 1 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM0    Timer 0 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_LB3     Line/byte event 3 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB2     Line/byte event 2 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB1     Line/byte event 1 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB0     Line/byte event 0 reached interrupt
  * @retval None
  */
#define __HAL_DCMIPP_CSI_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->IER0 |= (__INTERRUPT__))
/**
  * @brief  Disable the specified DCMIPP CSI interrupts.
  * @param  __HANDLE__    CSI handle
  * @param  __INTERRUPT__ specifies the DCMIPP CSI interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_IT_SYNCERR Synchronization error interrupt
  *            @arg DCMIPP_CSI_IT_WDERR   Watchdog error interrupt
  *            @arg DCMIPP_CSI_IT_SPKTERR Shorter packet than expected error interrupt
  *            @arg DCMIPP_CSI_IT_IDERR   Data ID information error interrupt
  *            @arg DCMIPP_CSI_IT_CECCERR Corrected ECC error interrupt
  *            @arg DCMIPP_CSI_IT_ECCERR  ECC Error interrupt
  *            @arg DCMIPP_CSI_IT_CRCERR  CRC Error interrupt
  *            @arg DCMIPP_CSI_IT_CCFIFO  Clock changer FIFO full event interrupt
  *            @arg DCMIPP_CSI_IT_SPKT    Short packet detection interrupt
  *            @arg DCMIPP_CSI_IT_EOF3    EOF on virtual channel 3 interrupt
  *            @arg DCMIPP_CSI_IT_EOF2    EOF on virtual channel 2 interrupt
  *            @arg DCMIPP_CSI_IT_EOF1    EOF on virtual channel 1 interrupt
  *            @arg DCMIPP_CSI_IT_EOF0    EOF on virtual channel 0 interrupt
  *            @arg DCMIPP_CSI_IT_SOF3    SOF on virtual channel 3 interrupt
  *            @arg DCMIPP_CSI_IT_SOF2    SOF on virtual channel 2 interrupt
  *            @arg DCMIPP_CSI_IT_SOF1    SOF on virtual channel 1 interrupt
  *            @arg DCMIPP_CSI_IT_SOF0    SOF on virtual channel 0 interrupt
  *            @arg DCMIPP_CSI_IT_TIM3    Timer 3 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM2    Timer 2 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM1    Timer 1 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM0    Timer 0 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_LB3     Line/byte event 3 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB2     Line/byte event 2 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB1     Line/byte event 1 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB0     Line/byte event 0 reached interrupt
  * @retval None
  */
#define __HAL_DCMIPP_CSI_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->IER0 &= ~(__INTERRUPT__))
/**
  * @brief  Get the DCMIPP CSI pending interrupt flags.
  * @param  __HANDLE__    CSI handle
  * @param  __FLAG__   Get the specified flag.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_FLAG_SYNCERR Synchronization error flag
  *            @arg DCMIPP_CSI_FLAG_WDERR   Watchdog error flag
  *            @arg DCMIPP_CSI_FLAG_SPKTERR Shorter packet than expected error flag
  *            @arg DCMIPP_CSI_FLAG_IDERR   Data ID information error flag
  *            @arg DCMIPP_CSI_FLAG_CECCERR Corrected ECC error flag
  *            @arg DCMIPP_CSI_FLAG_ECCERR  ECC Error flag
  *            @arg DCMIPP_CSI_FLAG_CRCERR  CRC Error flag
  *            @arg DCMIPP_CSI_FLAG_CCFIFO  Clock changer FIFO full event flag
  *            @arg DCMIPP_CSI_FLAG_SPKT    Short packet detection flag
  *            @arg DCMIPP_CSI_FLAG_EOF3    EOF on virtual channel 3 flag
  *            @arg DCMIPP_CSI_FLAG_EOF2    EOF on virtual channel 2 flag
  *            @arg DCMIPP_CSI_FLAG_EOF1    EOF on virtual channel 1 flag
  *            @arg DCMIPP_CSI_FLAG_EOF0    EOF on virtual channel 0 flag
  *            @arg DCMIPP_CSI_FLAG_SOF3    SOF on virtual channel 3 flag
  *            @arg DCMIPP_CSI_FLAG_SOF2    SOF on virtual channel 2 flag
  *            @arg DCMIPP_CSI_FLAG_SOF1    SOF on virtual channel 1 flag
  *            @arg DCMIPP_CSI_FLAG_SOF0    SOF on virtual channel 0 flag
  *            @arg DCMIPP_CSI_FLAG_TIM3    Timer 3 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_TIM2    Timer 2 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_TIM1    Timer 1 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_TIM0    Timer 0 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_LB3     Line/byte event 3 reached flag
  *            @arg DCMIPP_CSI_FLAG_LB2     Line/byte event 2 reached flag
  *            @arg DCMIPP_CSI_FLAG_LB1     Line/byte event 1 reached flag
  *            @arg DCMIPP_CSI_FLAG_LB0     Line/byte event 0 reached flag
  * @retval None
  */
#define __HAL_DCMIPP_CSI_GET_FLAG(__HANDLE__, __FLAG__)((__HANDLE__)->IER0 & (__FLAG__))
/**
  * @brief  Clear the DCMIPP CSI pending interrupt flags.
  * @param  __HANDLE__    CSI handle
  * @param  __FLAG__   specifies the flag to clear.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_FLAG_SYNCERR Synchronization error flag
  *            @arg DCMIPP_CSI_FLAG_WDERR   Watchdog error flag
  *            @arg DCMIPP_CSI_FLAG_SPKTERR Shorter packet than expected error flag
  *            @arg DCMIPP_CSI_FLAG_IDERR   Data ID information error flag
  *            @arg DCMIPP_CSI_FLAG_CECCERR Corrected ECC error flag
  *            @arg DCMIPP_CSI_FLAG_ECCERR  ECC Error flag
  *            @arg DCMIPP_CSI_FLAG_CRCERR  CRC Error flag
  *            @arg DCMIPP_CSI_FLAG_CCFIFO  Clock changer FIFO full event flag
  *            @arg DCMIPP_CSI_FLAG_SPKT    Short packet detection flag
  *            @arg DCMIPP_CSI_FLAG_EOF3    EOF on virtual channel 3 flag
  *            @arg DCMIPP_CSI_FLAG_EOF2    EOF on virtual channel 2 flag
  *            @arg DCMIPP_CSI_FLAG_EOF1    EOF on virtual channel 1 flag
  *            @arg DCMIPP_CSI_FLAG_EOF0    EOF on virtual channel 0 flag
  *            @arg DCMIPP_CSI_FLAG_SOF3    SOF on virtual channel 3 flag
  *            @arg DCMIPP_CSI_FLAG_SOF2    SOF on virtual channel 2 flag
  *            @arg DCMIPP_CSI_FLAG_SOF1    SOF on virtual channel 1 flag
  *            @arg DCMIPP_CSI_FLAG_SOF0    SOF on virtual channel 0 flag
  *            @arg DCMIPP_CSI_FLAG_TIM3    Timer 3 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_TIM2    Timer 2 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_TIM1    Timer 1 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_TIM0    Timer 0 counter value reached flag
  *            @arg DCMIPP_CSI_FLAG_LB3     Line/byte event 3 reached flag
  *            @arg DCMIPP_CSI_FLAG_LB2     Line/byte event 2 reached flag
  *            @arg DCMIPP_CSI_FLAG_LB1     Line/byte event 1 reached flag
  *            @arg DCMIPP_CSI_FLAG_LB0     Line/byte event 0 reached flag
  * @retval None
  */
#define __HAL_DCMIPP_CSI_CLEAR_FLAG(__HANDLE__, __FLAG__)((__HANDLE__)->FCR0 = (__FLAG__))
/**
  * @brief  Checks whether the specified DCMIPP interrupt is enabled or not.
  * @param  __HANDLE__    DCMIPP handle
  * @param  __INTERRUPT__ specifies the DCMIPP interrupt sources to be checked.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_IT_SYNCERR Synchronization error interrupt
  *            @arg DCMIPP_CSI_IT_WDERR   Watchdog error interrupt
  *            @arg DCMIPP_CSI_IT_SPKTERR Shorter packet than expected error interrupt
  *            @arg DCMIPP_CSI_IT_IDERR   Data ID information error interrupt
  *            @arg DCMIPP_CSI_IT_CECCERR Corrected ECC error interrupt
  *            @arg DCMIPP_CSI_IT_ECCERR  ECC Error interrupt
  *            @arg DCMIPP_CSI_IT_CRCERR  CRC Error interrupt
  *            @arg DCMIPP_CSI_IT_CCFIFO  Clock changer FIFO full event interrupt
  *            @arg DCMIPP_CSI_IT_SPKT    Short packet detection interrupt
  *            @arg DCMIPP_CSI_IT_EOF3    EOF on virtual channel 3 interrupt
  *            @arg DCMIPP_CSI_IT_EOF2    EOF on virtual channel 2 interrupt
  *            @arg DCMIPP_CSI_IT_EOF1    EOF on virtual channel 1 interrupt
  *            @arg DCMIPP_CSI_IT_EOF0    EOF on virtual channel 0 interrupt
  *            @arg DCMIPP_CSI_IT_SOF3    SOF on virtual channel 3 interrupt
  *            @arg DCMIPP_CSI_IT_SOF2    SOF on virtual channel 2 interrupt
  *            @arg DCMIPP_CSI_IT_SOF1    SOF on virtual channel 1 interrupt
  *            @arg DCMIPP_CSI_IT_SOF0    SOF on virtual channel 0 interrupt
  *            @arg DCMIPP_CSI_IT_TIM3    Timer 3 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM2    Timer 2 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM1    Timer 1 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_TIM0    Timer 0 counter value reached interrupt
  *            @arg DCMIPP_CSI_IT_LB3     Line/byte event 3 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB2     Line/byte event 2 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB1     Line/byte event 1 reached interrupt
  *            @arg DCMIPP_CSI_IT_LB0     Line/byte event 0 reached interrupt
  * @retval The state of DCMIPP interrupt (SET or RESET).
  */
#define __HAL_DCMIPP_CSI_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((((__HANDLE__)->IER0 & (__INTERRUPT__)) == \
                                                                    (__INTERRUPT__)) ? SET : RESET)
/**
  * @brief  Enable the specified DCMIPP CSI DPHY interrupts.
  * @param  __HANDLE__    CSI handle
  * @param  __INTERRUPT__ specifies the DCMIPP CSI interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_IT_ECTRLDL1    Error control on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESYNCESCDL1 Low-power data transmission synchronization error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_EESCDL1     Escape entry error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTSYNCDL1 SOT synchronization error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTDL1     SOT error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ECTRLDL0    Error control on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESYNCESCDL0 Low-power data transmission synchronization error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_EESCDL0     Escape entry error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTSYNCDL0 SOT synchronization error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTDL0     SOT error on data line 0 interrupt
  * @retval None
  */
#define __HAL_DCMIPP_CSI_DPHY_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->IER1 |= (__INTERRUPT__))
/**
  * @brief  Disable the specified DCMIPP CSI DPHY interrupts.
  * @param  __HANDLE__    CSI handle
  * @param  __INTERRUPT__ specifies the DCMIPP CSI interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_IT_ECTRLDL1    Error control on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESYNCESCDL1 Low-power data transmission synchronization error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_EESCDL1     Escape entry error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTSYNCDL1 SOT synchronization error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTDL1     SOT error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ECTRLDL0    Error control on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESYNCESCDL0 Low-power data transmission synchronization error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_EESCDL0     Escape entry error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTSYNCDL0 SOT synchronization error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTDL0     SOT error on data line 0 interrupt
  * @retval None
  */
#define __HAL_DCMIPP_CSI_DPHY_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->IER1 &= ~(__INTERRUPT__))
/**
  * @brief  Get the DCMIPP CSI DPHY pending interrupt flags.
  * @param  __HANDLE__    CSI handle
  * @param  __FLAG__   Get the specified flag.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_FLAG_ECTRLDL1    Error control on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ESYNCESCDL1 Low-power data transmission synchronization error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_EESCDL1     Escape entry error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTSYNCDL1 SOT synchronization error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTDL1     SOT error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ECTRLDL0    Error control on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_ESYNCESCDL0 Low-power data transmission synchronization error on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_EESCDL0     Escape entry error on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTSYNCDL0 SOT synchronization error on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTDL0     SOT error on data line 0 flag
  * @retval None
  */
#define __HAL_DCMIPP_CSI_GET_DPHY_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->IER1 & (__FLAG__))
/**
  * @brief  Clear the DCMIPP CSI DPHY pending interrupt flags.
  * @param  __HANDLE__    CSI handle
  * @param  __FLAG__   specifies the flag to clear.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_FLAG_ECTRLDL1    Error control on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ESYNCESCDL1 Low-power data transmission synchronization error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_EESCDL1     Escape entry error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTSYNCDL1 SOT synchronization error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTDL1     SOT error on data line 1 flag
  *            @arg DCMIPP_CSI_FLAG_ECTRLDL0    Error control on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_ESYNCESCDL0 Low-power data transmission synchronization error on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_EESCDL0     Escape entry error on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTSYNCDL0 SOT synchronization error on data line 0 flag
  *            @arg DCMIPP_CSI_FLAG_ESOTDL0     SOT error on data line 0 flag
  * @retval None
  */
#define __HAL_DCMIPP_CSI_CLEAR_DPHY_FLAG(__HANDLE__, __FLAG__)((__HANDLE__)->FCR1 = (__FLAG__))
/**
  * @brief  Checks whether the specified DCMIPP CSI DPHY interrupt is enabled or not.
  * @param  __HANDLE__    CSI handle
  * @param  __INTERRUPT__ specifies the DCMIPP CSI D-PHY interrupt sources to be checked.
  *         This parameter can be any combination of the following values:
  *            @arg DCMIPP_CSI_IT_ECTRLDL1    Error control on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESYNCESCDL1 Low-power data transmission synchronization error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_EESCDL1     Escape entry error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTSYNCDL1 SOT synchronization error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTDL1     SOT error on data line 1 interrupt
  *            @arg DCMIPP_CSI_IT_ECTRLDL0    Error control on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESYNCESCDL0 Low-power data transmission synchronization error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_EESCDL0     Escape entry error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTSYNCDL0 SOT synchronization error on data line 0 interrupt
  *            @arg DCMIPP_CSI_IT_ESOTDL0     SOT error on data line 0 interrupt
  * @retval None
  */
#define __HAL_DCMIPP_CSI_GET_DPHY_IT_SOURCE(__HANDLE__,  __INTERRUPT__)((((__HANDLE__)->IER1 & (__INTERRUPT__)) == \
                                                                         (__INTERRUPT__)) ? SET : RESET)
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup DCMIPP_Exported_Functions
  * @{
  */

/** @addtogroup DCMIPP_Initialization_De-Initialization_Functions DCMIPP Initialization De-Initialization Functions
  * @brief      Initialization and De-Initialization Functions
  * @{
  */
HAL_StatusTypeDef HAL_DCMIPP_Init(DCMIPP_HandleTypeDef *hdcmipp);
HAL_StatusTypeDef HAL_DCMIPP_DeInit(DCMIPP_HandleTypeDef *hdcmipp);
void HAL_DCMIPP_MspInit(DCMIPP_HandleTypeDef *hdcmipp);
void HAL_DCMIPP_MspDeInit(DCMIPP_HandleTypeDef *hdcmipp);
/**
  * @}
  */

/** @defgroup DCMIPP_Configuration_Functions DCMIPP Configuration Functions
  * @brief    Configuration Functions
  * @{
  */

