micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableComponentsSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableComponentsSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableRedBlueSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableRedBlueSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableYUVSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableYUVSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
/**
  * @}
  */

/** @defgroup DCMIPP_Frame_Counter_Functions DCMIPP Frame Counter Functions
  * @{
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetFrameCounterConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_ResetFrameCounter(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_ReadFrameCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                   uint32_t *pCounter);
/**
  * @}
  */
/** @defgroup DCMIPP_Data_Counter_Functions DCMIPP Data Counter Functions
  * @{
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetDataCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                 uint32_t *pCounter);
/**
  * @}
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetISPRemovedBadPixelCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                               uint32_t *pCounter);
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetISPAccumulatedStatisticsCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                                     uint8_t ModuleID, uint32_t *pCounter);
uint32_t HAL_DCMIPP_GetMode(const DCMIPP_HandleTypeDef *hdcmipp);
uint32_t HAL_DCMIPP_PIPE_GetMemoryAddress(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t MemoryAddress);

/** @addtogroup DCMIPP_State_and_Error_Functions DCMIPP State and Error Functions
  * @{
  */
HAL_DCMIPP_StateTypeDef HAL_DCMIPP_GetState(const DCMIPP_HandleTypeDef *hdcmipp);
HAL_DCMIPP_PipeStateTypeDef HAL_DCMIPP_PIPE_GetState(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe);
uint32_t HAL_DCMIPP_GetError(const DCMIPP_HandleTypeDef *hdcmipp);

/**
  * @}
  */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup DCMIPP_Private_Macros DCMIPP Private Macros
  * @{
  */
#define IS_DCMIPP_PIPE(PIPE) (((PIPE) == DCMIPP_PIPE0) || \
                              ((PIPE) == DCMIPP_PIPE1) || \
                              ((PIPE) == DCMIPP_PIPE2))
#define IS_DCMIPP_FORMAT(FORMAT) (((FORMAT) == DCMIPP_FORMAT_BYTE)   ||\
                                  ((FORMAT) == DCMIPP_FORMAT_YUV422) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RGB565) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RGB666) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RGB888) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RAW8  ) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RAW10 ) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RAW12 ) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_RAW14 ) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_MONOCHROME_8B)  ||\
                                  ((FORMAT) == DCMIPP_FORMAT_MONOCHROME_10B) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_MONOCHROME_12B) ||\
                                  ((FORMAT) == DCMIPP_FORMAT_MONOCHROME_14B))

#define IS_DCMIPP_PIXEL_PACKER_FORMAT(FORMAT) (((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_RGB888_YUV444_1) ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_RGB565_1)        ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_ARGB8888)        ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_RGBA888)         ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_MONO_Y8_G8_1)    ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_YUV444_1)        ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1)        ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_YUV422_2)        ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_YUV420_2)        ||\
                                               ((FORMAT) == DCMIPP_PIXEL_PACKER_FORMAT_YUV420_3))

#define IS_DCMIPP_PIXEL_PIPE_PITCH(PITCH) ((((PITCH) & 0xFU) == 0U) && ((PITCH) <= 0x7FFFU))

#define IS_DCMIPP_PCKPOLARITY(POLARITY)(((POLARITY) == DCMIPP_PCKPOLARITY_FALLING) || \
                                        ((POLARITY) == DCMIPP_PCKPOLARITY_RISING))

#define IS_DCMIPP_VSPOLARITY(POLARITY)(((POLARITY) == DCMIPP_VSPOLARITY_LOW) || \
                                       ((POLARITY) == DCMIPP_VSPOLARITY_HIGH))

#define IS_DCMIPP_HSPOLARITY(POLARITY)(((POLARITY) == DCMIPP_HSPOLARITY_LOW) || \
                                       ((POLARITY) == DCMIPP_HSPOLARITY_HIGH))


#define IS_DCMIPP_EXTENDED_DATA_MODE(INTERFACE)(((INTERFACE) == DCMIPP_INTERFACE_8BITS ) ||\
                                                ((INTERFACE) == DCMIPP_INTERFACE_10BITS) ||\
                                                ((INTERFACE) == DCMIPP_INTERFACE_12BITS) ||\
                                                ((INTERFACE) == DCMIPP_INTERFACE_14BITS) ||\
                                                ((INTERFACE) == DCMIPP_INTERFACE_16BITS))

#define IS_DCMIPP_SYNC_MODE(SYNC_MODE) (((SYNC_MODE) == DCMIPP_SYNCHRO_HARDWARE) ||\
                                        ((SYNC_MODE) == DCMIPP_SYNCHRO_EMBEDDED))

#define IS_DCMIPP_SWAP_BITS(SWAP_BITS)  (((SWAP_BITS) == DCMIPP_SWAPBITS_ENABLE) ||\
                                         ((SWAP_BITS) == DCMIPP_SWAPBITS_DISABLE))

#define IS_DCMIPP_SWAP_CYCLES(SWAP_CYCLES) (((SWAP_CYCLES) == DCMIPP_SWAPCYCLES_ENABLE) ||\
                                            ((SWAP_CYCLES) == DCMIPP_SWAPCYCLES_DISABLE))

#define IS_DCMIPP_VCID(VCID) (((VCID) == DCMIPP_VIRTUAL_CHANNEL0) ||\
                              ((VCID) == DCMIPP_VIRTUAL_CHANNEL1) ||\
                              ((VCID) == DCMIPP_VIRTUAL_CHANNEL2) ||\
                              ((VCID) == DCMIPP_VIRTUAL_CHANNEL3))

#define IS_DCMIPP_DATA_TYPE_MODE(DATA_TYPE_MODE) (((DATA_TYPE_MODE) == DCMIPP_DTMODE_DTIDA) ||\
                                                  ((DATA_TYPE_MODE) == DCMIPP_DTMODE_DTIDA_OR_DTIDB) ||\
                                                  ((DATA_TYPE_MODE) == DCMIPP_DTMODE_ALL_EXCEPT_DTIA_DTIB) ||\
                                                  ((DATA_TYPE_MODE) == DCMIPP_DTMODE_ALL))

#define IS_DCMIPP_DATA_TYPE(DATA_TYPE) (((DATA_TYPE) == DCMIPP_DT_RGB565) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RGB444) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RGB555) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RGB666) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RGB888) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_YUV420_8) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_YUV420_10) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_YUV422_8) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_YUV422_10) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RAW8) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RAW10) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RAW12) ||\
                                        ((DATA_TYPE) == DCMIPP_DT_RAW14))

