micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
#define IS_DCMIPP_NUMBER_OF_LANES(DATA_LANE_NB) (((DATA_LANE_NB) == DCMIPP_CSI_ONE_DATA_LANE) ||\
                                                 ((DATA_LANE_NB) == DCMIPP_CSI_TWO_DATA_LANES))

#define IS_DCMIPP_CSI_DATA_LANE_MAPPING(DATA_LANE_MAP) (((DATA_LANE_MAP) == DCMIPP_CSI_PHYSICAL_DATA_LANES) ||\
                                                        ((DATA_LANE_MAP) == DCMIPP_CSI_INVERTED_DATA_LANES))
#define IS_DCMIPP_CSI_DATA_PHY_BITRATE(PHY_BITRATE) ((PHY_BITRATE) <= DCMIPP_CSI_PHY_BT_2500)
#define IS_DCMIPP_CSI_DATA_TYPE_NB(DATA_TYPE_NB) ((DATA_TYPE_NB) <= MAX_DATATYPE_NB)

#define IS_DCMIPP_CSI_DATA_TYPE_FORMAT(DATA_TYPE_FORMAT) (((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP6)  ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP7)  ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP8)  ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP10) ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP12) ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP14) ||\
                                                          ((DATA_TYPE_FORMAT) == DCMIPP_CSI_DT_BPP16))
#define IS_DCMIPP_CSI_DATA_CLASS(DATA_TYPE_CLASS)((DATA_TYPE_CLASS) <= 0x3FU)
#define IS_DCMIPP_CSI_COUNTER(COUNTER) (((COUNTER) == DCMIPP_CSI_COUNTER0) ||\
                                        ((COUNTER) == DCMIPP_CSI_COUNTER1) ||\
                                        ((COUNTER) == DCMIPP_CSI_COUNTER2) ||\
                                        ((COUNTER) == DCMIPP_CSI_COUNTER3))
#define IS_DCMIPP_CSI_LINE_COUNTER(LINE_COUNTER)((LINE_COUNTER) <= 0xFFFFU)
#define IS_DCMIPP_CSI_BYTE_COUNTER(BYTE_COUNTER)((BYTE_COUNTER) <= 0xFFFFU)

#define IS_DCMIPP_CSI_TIMER(TIMER) (((TIMER) == DCMIPP_CSI_TIMER0) ||\
                                    ((TIMER) == DCMIPP_CSI_TIMER1) ||\
                                    ((TIMER) == DCMIPP_CSI_TIMER2) ||\
                                    ((TIMER) == DCMIPP_CSI_TIMER3))
#define IS_DCMIPP_CSI_TIMER_START(TIMER_START) (((TIMER_START) == DCMIPP_CSI_TIMER_START_SOF)||\
                                                ((TIMER_START) == DCMIPP_CSI_TIMER_START_EOF))


#define IS_DCMIPP_FRAME_RATE(FRAME_RATE) (((FRAME_RATE) == DCMIPP_FRAME_RATE_ALL)      ||\
                                          ((FRAME_RATE) == DCMIPP_FRAME_RATE_1_OVER_2) ||\
                                          ((FRAME_RATE) == DCMIPP_FRAME_RATE_1_OVER_4) ||\
                                          ((FRAME_RATE) == DCMIPP_FRAME_RATE_1_OVER_8))
#define IS_DCMIPP_CLIENT(CLIENT) (((CLIENT) == DCMIPP_CLIENT1) ||\
                                  ((CLIENT) == DCMIPP_CLIENT2) ||\
                                  ((CLIENT) == DCMIPP_CLIENT3) ||\
                                  ((CLIENT) == DCMIPP_CLIENT4) ||\
                                  ((CLIENT) == DCMIPP_CLIENT5))

#define IS_DCMIPP_DPREG_END(DPREG_END) ((DPREG_END) <= 0x3FFU)
#define IS_DCMIPP_DPREG_START(DPREG_START) ((DPREG_START) <= 0x3FFU)

#define IS_DCMIPP_MAX_OUTSTANDING_TRANSACTIONS(OUTS_TRANS) (((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_NONE )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_2    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_3    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_4    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_5    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_6    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_7    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_8    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_9    )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_10   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_11   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_12   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_13   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_14   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_15   )||\
                                                            ((OUTS_TRANS) == DCMIPP_OUTSTANDING_TRANSACTION_16   ))

#define IS_DCMIPP_MEMORY_PAGE_SIZE(MEMORY_PAGE_SIZE) (((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_64BYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_128BYTES) ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_256BYTES) ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_512BYTES) ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_1KBYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_2KBYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_4KBYTES)  ||\
                                                      ((MEMORY_PAGE_SIZE) ==  DCMIPP_MEMORY_PAGE_SIZE_8KBYTES))
#define IS_DCMIPP_TRAFFIC(TRAFFIC) (((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_8BYTES ) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_16BYTES) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_32BYTES) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_64BYTES) ||\
                                    ((TRAFFIC) == DCMIPP_TRAFFIC_BURST_SIZE_128BYTES))
#define IS_DCMIPP_WLRU_RATIO(WLRU_RATIO) ((WLRU_RATIO)<= 0xFU)

