micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dcmipp.h
#define IS_DCMIPP_CAPTURE_MODE(CAPTURE_MODE) (((CAPTURE_MODE) == DCMIPP_MODE_CONTINUOUS)||\
                                              ((CAPTURE_MODE) == DCMIPP_MODE_SNAPSHOT))

#define IS_DCMIPP_PIPE_CROP_AREA(CROP_AREA)(((CROP_AREA) == DCMIPP_POSITIVE_AREA) ||\
                                            ((CROP_AREA) == DCMIPP_NEGATIVE_AREA))

#define IS_DCMIPP_PIPE_CROP_HSIZE(CROP_HSIZE) (((CROP_HSIZE) >= 0x1U) && ((CROP_HSIZE) <= 0xFFFU))
#define IS_DCMIPP_PIPE_CROP_VSIZE(CROP_VSIZE) (((CROP_VSIZE) >= 0x1U) && ((CROP_VSIZE) <= 0xFFFU))
#define IS_DCMIPP_PIPE_CROP_VSTART(CROP_VSTART) ((CROP_VSTART) <= 0xFFFU)
#define IS_DCMIPP_PIPE_CROP_HSTART(CROP_HSTART) ((CROP_HSTART) <= 0xFFFU)

#define IS_DCMIPP_BYTE_SELECT_MODE(BYTE_SELECT) (((BYTE_SELECT) == DCMIPP_BSM_ALL)        ||\
                                                 ((BYTE_SELECT) == DCMIPP_BSM_DATA_OUT_2) ||\
                                                 ((BYTE_SELECT) == DCMIPP_BSM_BYTE_OUT_4) ||\
                                                 ((BYTE_SELECT) == DCMIPP_BSM_2BYTE_OUT_4))

#define IS_DCMIPP_BYTE_SELECT_START(BYTE_START)(((BYTE_START) == DCMIPP_OEBS_ODD) ||\
                                                ((BYTE_START) == DCMIPP_OEBS_EVEN))

#define IS_DCMIPP_LINE_SELECT_MODE(LINE_SELECT) (((LINE_SELECT) == DCMIPP_LSM_ALL) ||\
                                                 ((LINE_SELECT) == DCMIPP_LSM_ALTERNATE_2))

#define IS_DCMIPP_LINE_SELECT_START(LINE__START)(((LINE__START) == DCMIPP_OELS_ODD) ||\
                                                 ((LINE__START) == DCMIPP_OELS_EVEN))

#define IS_DCMIPP_MEMORY_ADDRESS(MEMORY_ADDRESS) (((MEMORY_ADDRESS) == DCMIPP_MEMORY_ADDRESS_0) ||\
                                                  ((MEMORY_ADDRESS) == DCMIPP_MEMORY_ADDRESS_1))

#define IS_DCMIPP_DATA_LIMIT(DATA_LIMIT) (((DATA_LIMIT) >=1U ) && ((DATA_LIMIT) <= 0xFFFFFFU))

#define IS_DCMIPP_PIPE_MULTILINE(MULTILINE) (((MULTILINE) == DCMIPP_MULTILINE_1_LINE )   ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_2_LINES)  ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_4_LINES)  ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_8_LINES)  ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_16_LINES) ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_32_LINES) ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_64_LINES) ||\
                                             ((MULTILINE) == DCMIPP_MULTILINE_128_LINES))
#define IS_DCMIPP_VRATIO(VRATIO) (((VRATIO) == DCMIPP_VDEC_ALL)     ||\
                                  ((VRATIO) == DCMIPP_VDEC_1_OUT_2) ||\
                                  ((VRATIO) == DCMIPP_VDEC_1_OUT_4) ||\
                                  ((VRATIO) == DCMIPP_VDEC_1_OUT_8))

#define IS_DCMIPP_HRATIO(HRATIO) (((HRATIO) == DCMIPP_HDEC_ALL)     ||\
                                  ((HRATIO) == DCMIPP_HDEC_1_OUT_2) ||\
                                  ((HRATIO) == DCMIPP_HDEC_1_OUT_4) ||\
                                  ((HRATIO) == DCMIPP_HDEC_1_OUT_8))

#define IS_DCMIPP_DOWSIZE_DIV_FACTOR(DIV_FACTOR) (((DIV_FACTOR)>=0x80U) && ((DIV_FACTOR)<= 0x3FFU))
#define IS_DCMIPP_DOWSIZE_RATIO(RATIO) ((RATIO)<= 0xFFFFU)
#define IS_DCMIPP_DOWSIZE_SIZE(SIZE) ((SIZE) <= 0xFFFU)

#define IS_DCMIPP_RAWBAYER2RGB_RAW_TYPE(RAW_TYPE) (((RAW_TYPE) == DCMIPP_RAWBAYER_RGGB) ||\
                                                   ((RAW_TYPE) == DCMIPP_RAWBAYER_GRBG) ||\
                                                   ((RAW_TYPE) == DCMIPP_RAWBAYER_GBRG) ||\
                                                   ((RAW_TYPE) == DCMIPP_RAWBAYER_BGGR))

#define IS_DCMIPP_RAWBAYER2RGB_STRENGTH(STRENGTH) (((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_NONE)       ||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_3) ||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_4) ||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_6) ||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_8) ||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_12)||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_16)||\
                                                   ((STRENGTH) ==  DCMIPP_RAWBAYER_ALGO_STRENGTH_24))

#define IS_DCMIPP_NB_FIRST_LINES(NB_FIRST_LINES) ((NB_FIRST_LINES) <= 7U)

#define IS_DCMIPP_NB_LAST_LINES(NB_LAST_LINES) ((NB_LAST_LINES) <= 0xFFFU)

#define IS_DCMIPP_BAD_PXL_REMOVAL_STRENGTH(STRENGTH) (((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_0) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_1) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_2) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_3) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_4) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_5) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_6) ||\
                                                      ((STRENGTH) ==  DCMIPP_BAD_PXL_REM_SRENGTH_7))

#define IS_DCMIPP_ROI_COLOR(COLOR) ((COLOR) <= 3U)
#define IS_DCMIPP_ROI_SIZE(SIZE) ((SIZE) <= 3U)
#define IS_DCMIPP_ROI_START(START) ((START) <= 3U)
#define IS_DCMIPP_ROI_LINE_WIDTH(LINE_WIDTH) ((LINE_WIDTH) <= DCMIPP_LINE_WIDTH_8PXL)
#define IS_DCMIPP_ROI(REGION_OF_INTEREST) ((REGION_OF_INTEREST) <= DCMIPP_REGION_OF_INTEREST8)

#define IS_DCMIPP_ADDRESS_WRAP(ADDRESS_WRAP) (((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_1_LINE)   ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_2_LINES)  ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_4_LINES)  ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_8_LINES)  ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_16_LINES) ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_32_LINES) ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_64_LINES) ||\
                                              ((ADDRESS_WRAP) == DCMIPP_WRAP_ADDRESS_128_LINES))

#define IS_DCMIPP_OUTPUT_SAMPLES_TYPES(OUTPUT_SAMPLES_TYPES) (((OUTPUT_SAMPLES_TYPES) == DCMIPP_CLAMP_YUV) ||\
                                                              ((OUTPUT_SAMPLES_TYPES) == DCMIPP_CLAMP_RGB))
#define IS_DCMIPP_COLOR_CONVERSION_COEF(COLOR_CONV_CONF) ((COLOR_CONV_CONF) <= 0x7FF)

#define IS_DCMIPP_STAT_EXTRACTION_MODULE(MODULE) (((MODULE) == DCMIPP_STATEXT_MODULE1)||\
                                                  ((MODULE) == DCMIPP_STATEXT_MODULE2)||\
                                                  ((MODULE) == DCMIPP_STATEXT_MODULE3))

#define IS_DCMIPP_LUMINANCE(LUMINANCE) ((LUMINANCE) <= 0x3FU)

#define IS_DCMIPP_EXPOSURE_SHF(CHIFT) ((CHIFT) <= 0x7U)

#define IS_DCMIPP_STAT_EXTRACTION_BINS(BINS) (((BINS) ==  DCMIPP_STAT_EXT_BINS_MODE_LOWER_BINS)  ||\
                                              ((BINS) == DCMIPP_STAT_EXT_BINS_MODE_LOWMID_BINS) ||\
                                              ((BINS) == DCMIPP_STAT_EXT_BINS_MODE_UPMID_BINS ) ||\
                                              ((BINS) == DCMIPP_STAT_EXT_BINS_MODE_UP_BINS    ) ||\
                                              ((BINS) == DCMIPP_STAT_EXT_AVER_MODE_ALL_PIXELS ) ||\
                                              ((BINS) == DCMIPP_STAT_EXT_AVER_MODE_NOEXT16    ) ||\
                                              ((BINS) == DCMIPP_STAT_EXT_AVER_MODE_NOEXT32    ) ||\
                                              ((BINS) == DCMIPP_STAT_EXT_AVER_MODE_NOEXT64    ))

#define IS_DCMIPP_STAT_EXTRACTION_SOURCE(SOURCE) (((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_R) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_G) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_B) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_PRE_BLKLVL_L) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_R) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_G) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_B) ||\
                                                  ((SOURCE) == DCMIPP_STAT_EXT_SOURCE_POST_DEMOS_L))

#define IS_DCMIPP_STAT_EXTRACTION_MODE(MODE) (((MODE) == DCMIPP_STAT_EXT_MODE_AVERAGE) ||\
                                              ((MODE) == DCMIPP_STAT_EXT_MODE_BINS))

#define IS_DCMIPP_PIPE_STAT_EXTRACTION_START(START) ((START) <= 0xFFFU)
#define IS_DCMIPP_PIPE_STAT_EXTRACTION_SIZE(SIZE) ((SIZE) <= 0xFFFU)

/**
  * @}
  */

/**
  * @}
  */

#endif /* DCMIPP */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32N6xx_HAL_DCMIPP_H */

